Revit 2027 API
BuiltInFailures.SiteImportFailures.InvalidBoundaryError Property
 Failed to get a valid boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidBoundaryError { get; }
Public Shared ReadOnly Property InvalidBoundaryError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidBoundaryError {
	FailureDefinitionId^ get ();
}
static member InvalidBoundaryError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace